from dotenv import load_dotenv
from pathlib import Path
import os

load_dotenv()

BASE_DIR = Path(__file__).resolve().parent.parent
DATA = "data"
AUTH = "config/auth"

AUTH_TWITTER = BASE_DIR / "config" / "auth" / "twitter_auth.json"

repo_name = "tweets-repo"
branch_name = "main"
path = "tweets.parquet"

lakefs_s3_path = f"s3://{repo_name}/{branch_name}/{path}"

tags = {
    "ธรรมศาสตร์": [
        "#ธรรมศาสตร์ช้างเผือก",
    #     "#TCAS",
    #     "#รับตรง",
    #     "#ทีมมธ",
    #     "#มธ", 
    #     "#dek70", 
    #     "#มอท่อ",
    #     "#TU89",
    ],
    # "คณะนิติศาสตร์":[
    #     # "#นิติศาสตร์",
    #     # "#LawTU",
    #     # "#TUlaw",
    #     "#นิติมธ",
    # ],
    # "คณะพาณิชยศาสตร์และการบัญชี":[
    #     "#บัญชีมธ",
    #     "##บริหารมธ",
    #     "#BBATU",
    # ],
    # "คณะรัฐศาสตร์":[
    #     "#รัฐศาสตร์มธ",
    #     "#LLBTU",
    #     "#BIRTU",
    #     "#singhadang",
    #     "#สิงห์แดง",
    # ],
    # "คณะเศรษฐศาสตร์":[
    #     "#เสดสาดมธ",
    #     # "#EconTU",
    #     # "#TUeconomics",
    # ],
    # "คณะสังคมสงเคราะห์ศาสตร์":[
    #     "#สังคมสงเคราะห์มธ",
    #     # "#SocialWorkTU",
    # ],
    # "คณะสังคมวิทยาและมานุษยวิทยา":[
    #     "#สังวิทมธ",
    #     # "#AnthroTU",
    # ],
    # "คณะศิลปศาสตร์":[
    #     "#สินสาดมธ",
    #     "#LartsTU",
    #     "#BASTU",
    # ],
    # "คณะวารสารศาสตร์และสื่อสารมวลชน":[
    #     "#BJMTU",
    #     "#JCTU",
    #     "#วารสารมธ",
    # ],
    # "คณะวิทยาศาสตร์และเทคโนโลยี":[
    #     "#วิทยามธ",
    #     "#วิดยามธ",
    # ],
    # "คณะวิศวกรรมศาสตร์":[
    #     "#วิดวะมธ",
    #     # "#EngTU",
    #     # "#TUengineering",
    # ],
    # "คณะสถาปัตยกรรมศาสตร์และการผังเมือง":[
    #     "#APTU",
    #     "#สถาปัตมธ",
    #     "#ถาปัตมธ",
    #     "#สถาปัตย์มธ",
    # ],
    # "คณะศิลปกรรมศาสตร์":[
    #     "#ละคอนมธ",
    #     "#สินกำมธ",
    # ],
    # "คณะแพทยศาสตร์":[
    #     "#แพทย์มธ",
    #     # "#MedTU",
    #     # "#TUmedicine",
    # ],
    # "คณะสหเวชศาสตร์":[
    #     "#สหเวชมธ",
    #     "#กายภาพมธ",
    #     "#เทคนิคมธ",
    # ],
    # "คณะทันตแพทยศาสตร์":[
    #     "#ทันตะมธ",
    #     # "#DentTU",
    #     # "#TUDentistry",
    # ],
    # "คณะพยาบาลศาสตร์":[
    #     "#พยาบาลมธ",
    #     # "#NurseTU",
    #     # "#TUnursing",
    # ],
    # "คณะสาธารณสุขศาสตร์":[
    #     "#fphtu",
    #     "#fphthammasat",
    # ],
    # "คณะเภสัชศาสตร์":[
    #     "#เภสัชมธ",
    #     # "#PharmTU",
    #     # "#TUpharmacy",
    # ],
    # "คณะวิทยาการเรียนรู้และศึกษาศาสตร์":[
    #     "#lsedtu",
    #     "#lsed",
    #     "#คณะวิทยาการเรียนรู้และศึกษาศาสตร์",
    # ],
    # "วิทยาลัยพัฒนศาสตร์ ป๋วย อึ๊งภากรณ์":[
    #     "#psdsTU",
    #     "#วป๋วย",
    #     "#วิทยาลัยป๋วย",
    #     "#วิทยาลัยพัฒนศาสตร์",
    # ],
    # "วิทยาลัยนวัตกรรม":[
    #     "#นวัตมธ",
    #     "#CITU",
    #     "#CITUSC",
    #     "#CITUTU",
    # ],
    # "วิทยาลัยสหวิทยาการ":[
    #     "#สหวิทยาการธรรมศาสตร์",
    #     "#InterdisciplinaryTU",
    # ],
    # "วิทยาลัยโลกคดีศึกษา":[
    #     "#โลกคดีธรรมศาสตร์",
    #     "#WorldStudiesTU",
    # ],
    # "สถาบันเทคโนโลยีนานาชาติสิรินธร":[
    #     "#SIIT",
    #     "#SIITThammasat",
    # ],
    # "วิทยาลัยนานาชาติ ปรีดี พนมยงค์":[
    #     "#ปรีดีนานาชาติ",
    #     "#PridiTU",
    #     "#TUinternational",
    # ],
    # "วิทยาลัยแพทยศาสตร์นานาชาติจุฬาภรณ์":[
    #     "#แพทย์นานาชาติธรรมศาสตร์",
    #     "#CICM",
    #     "#CICMTU",
    # ],
    # "สถาบันเสริมศึกษาและทรัพยากรมนุษย์":[
    #     "#เสริมศึกษาธรรมศาสตร์",
    #     "#HumanResourcesTU",
    # ],
    # "สถาบันไทยคดีศึกษา":[
    #     "#ไทยคดีธรรมศาสตร์",
    #     "#ThaiStudiesTU",
    # ],
    # "สถาบันเอเชียตะวันออกศึกษา":[
    #     "#เอเชียตะวันออกธรรมศาสตร์",
    #     "#EastAsianStudiesTU",
    # ],
    # "สถาบันภาษา":[
    #     "#สถาบันภาษาธรรมศาสตร์",
    #     "#LanguageInstituteTU",
    # ],
    # "สถาบันอาณาบริเวณศึกษา":[
    #     "#อาณาบริเวณธรรมศาสตร์",
    #     "#AreaStudiesTU",
    # ],
}